import { Text } from "@ui/components";
import React from "react";

export const agreement1 =
    <p>
        <Text typo ={'Header_20'}>이용 약관</Text><br/>
        <br/>
        <Text typo ={'Text_M_20'}>제 1조 목적</Text>
        <br/>
        <Text typo = {'Text_15'}>
            본 약관은 binary-ho (이하 “회사”)에서 제공하는 모든 제품 및 서비스(이하 “본 서비스”)의 이용에 관하여 회사와 본 서비스의 회원 또는 비회원과의 관계를 설명하는 것에 목적이
            있습니다.
            본 서비스를 이용하거나 회원가입을 통해 본 서비스의 회원이 될 경우 본 약관 및 관련 운영 정책을 동의하신 것으로 봅니다.
        </Text>
        <br/>
        <br/>
        <Text typo ={'Text_M_20'}>
            제 2조 용어 정의
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
            1. 사용자 생성 콘텐츠 - 회원이 본 서비스에서 생성한 강의, 출석, 수강 신청 등의 콘텐츠를 의미합니다. <br/>
            2. 학생 - 본 서비스에서 강사가 만든 강의를 수강 신청하고, 출석할 수 있는 회원 등급을 의미합니다. <br/>
            3. 강사 - 본 서비스에서 강의을 열 수 있고, 학생들의 수강 신청을 관리하고, 출석 데이터를 관리할 수 있는 회원 등급을 의미합니다. <br/>
            4. 수강 신청 - 강사가 개설한 강의를 수강하기 위한 학생의 신청 데이터입니다. 이름과 이메일 등이 노출됩니다. <br/>
            5. 출석 - 학생이 사용하는 강사가 개설한 강의에 출석하기 위한 기능입니다. 이 경우 이름과 이메일, 접속 시간과, 홍익대학교와의 거리 비교를 위한 접속 장소와 좌표 정확성 등이
            노출됩니다. <br/>
            6. 출석 관리 - 강사가 사용하는 기능으로 본인이 개설한 강의에 출석 신청한 학생들의 이름, 이메일, 접속 시간, 홍익대학교와의 거리와 정확성을 확인할 수 있는 기능입니다. <br/>
        </Text>
        <br/>
        <br/>
            <Text typo = {'Text_M_20'}>제 3조 약관 동의</Text><br/>
            <Text typo ={'Text_15'}>
        1. 회원은 본 약관의 규정에 따라 본 서비스를 이용해야 합니다. <br/>
        2. 회원이 미성년자일 경우에는 친권자 등 법정대리인의 동의를 얻은 후 본 서비스를 이용해야합니다. <br/>
        <br/>
        </Text>
        <Text typo ={'Text_M_20'}>제 4조 약관 변경</Text>
    
        <br/>
        <Text typo ={'Text_15'}>
        1. 회사에서 필요하다고 판단할 경우,회원에 대한 사전 통지 없이 언제라도 본 약관 및 개별 이용약관을 변경할 수 있습니다.
        변경 후의 본 약관 및 개별 이용약관은 회사가 회원들께 이메일로 전달한 시점부터 그 효력이 발생하며, 본 약관 및 개별 이용약관이 변경된 후에도 회원이 본 서비스를 계속 이용함으로써 변경 후의 본 약관
        및 적용된 개별 이용약관에 대해 유효하고 취소 불가능한 동의를 한 것으로 간주됩니다. 이러한 변경 내용은 회원에게 이메일을 통해 통지합니다. <br/>
        2. 회원이 변경된 약관에 관하여 동의하지 못할 경우 회사는 회원에게 변경된 약관을 강제로 적용하지 않습니다.

        다만 회원은 변경된 약관에 대한 동의없이 본 서비스를 이용할 수 없다는 것을 인지해야 합니다. 회원은 언제든지 회원탈퇴 신청을 통해 자유롭게 서비스 이용계약 해지가 가능합니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            제 5조 이용 계약 성립
            </Text>
        <br/>
        <Text typo ={'Text_15'}>
        1. 사용자가 본 서비스의 회원가입 기능을 이용하여 필요한 정보를 제출할 시 이용 약관이 체결됩니다. <br/>

        회사는 다음 각 호에 해당하는 회원에 관하여 언제든 이용계약을 해지할 수 있습니다. 각 호에 해당하는 경우는 보통 약관 위배, 관계 법령 위배, 사회질서 저해에 해당합니다.

        회사는 이들의 잘못된 서비스 이용을 방지하기 위해 노력합니다.

        다만 방지할 의무는 없으며, 따라서 방지하지 못한 책임을 지지 않습니다. <br/>

        2. 만 14세 미만인 경우 <br/>
        3. 타인의 명의를 이용한 경우 <br/>
        4. 등록 내용에 허위 정보를 기재하거나 필수 정보가 누락되었을 경우 <br/>
        5. 부정한 용도를 목적으로 본 서비스를 이용하는 경우 <br/>
        6. 본 서비스가 제공하는 방법 외의 방법으로 영리를 취하려고 하는 경우 <br/>
        7. 관계법령에 위배되는 경우 <br/>
        8. 사회의 질서 혹은 미풍양속을 저해할 수 있는 사용자 생성 콘텐츠를 업로드하는 경우 <br/>
        9. 타인의 권리나 명예를 침해하는 경우 <br/>
        10. 본 약관 위배로 회사에 의하여 이용계약이 해지된 경우 (회사에서 재가입 승낙한 경우 제외) <br/> <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 6조 이용 계약 종료
        </Text>
        <br/>
        <Text typo={'Text_15'}>
        1. 회원은 언제든지 회사에게 해지의사를 통지함으로써 이용계약을 해지할 수 있습니다. <br/>

        2. 이용계약은 회원의 해지의사가 회사에 도달한 때에 종료됩니다. <br/>

        3. 회원탈퇴 시 해당 계정의 개인정보는 파기됩니다. 다만 회사의 개인정보처리방침에 따른 정보는 정해진 기간동안 유지될 수 있습니다. 자세한 내용은 회사의 개인정보 수집 이용 동의 문서의
        개인정보처리방침을 참고 바랍니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 7조 회원의 의무와 책임
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        1. 회원은 회원 자신의 책임 하에 본 서비스를 이용해야 하며, 본 서비스에서 행한 모든 행위 및 그 결과에 대해서 모든 책임을 져야 합니다. <br/>
        2. 회사는 회원이 본 약관에 위반하는 형태로 본 서비스를 이용하고 있다고 판단되는 경우, 회사에 적절하다고 판단하는 조치를 취합니다. 다만 회사는 이러한 위반 행위를 방지 또는 시정할 의무를 갖지
        않습니다. <br/>
        3. 회원의 본 서비스 이용에 있어서, 또는 이러한 이용으로 제 3자로 부터 클레임을 받아 회사가 직접적 혹은 간접적으로 어떤 손해(변호사 비용 부담을 포함)를 입었을 경우, 회원은 회사의 요구에 따라
        즉시 이를 보상해야 합니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 8조 사용자 생성 콘텐츠
        </Text>
         <br/>
        <Text typo={'Text_15'}>
        1. 회원이 생성한 콘텐츠에 대한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.

        회사는 회원이 게시하거나 등록하는 콘텐츠의 내용물이 다음 각 항에 해당한다고 판단되는 경우에 사전통지 없이 삭제할 수 있으며, 이에 대하여 회사는 어떠한 책임도 지지 않습니다. <br/>

        2. 다른 회원 또는 제 3자를 비방하거나 명예를 손상시키는 내용의 콘텐츠 <br/>
        3. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크가 포함된 콘텐츠 <br/>
        4. 범죄와 결부된다고 객관적으로 인정되는 내용의 콘텐츠 <br/>
        5. 기타 관계 법령에 위배된다고 판단되는 내용의 콘텐츠 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 9조 면책조항
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        1. 회사는 서비스 제공을 위한 전자적인 범위(네트워크 통신, 데이터베이스 등)에 대해서는 회원의 개인정보를 안전하게 보호할 수 있도록 노력하고 있습니다.

        그러나 본 서비스의 특성상 회원의 개인정보를 다른 회원이 열람할 수 있는 경우가 존재합니다. <br/>

        이런 경우에 대해서는 회사가 개인정보를 '유출’한 것으로 보지 않아야 함을 회원은 인정해야 합니다.

        회원간 정보 확인이 가능한 경우는 수강 신청, 출석 등의 과정에서 발생하며 자세한 내용은 개인정보수집 이용 동의 문서를 참고해주세요 <br/>

        1) 사용자 생성 콘텐츠 (강의나 출석)를 생성하는 것은 다른 회원에게 해당 정보를 공개할 의도가 있다는 것을 인정하는 것입니다. (이름, 이메일, 접속 일시, 접속 장소 등) <br/>

        2. 회사는 강사와 학생 사이에서 강의 관리와 출석 관리의 어려움을 해소하는 서비스를 제공합니다.

        회사는 강사가 개설한 강좌나 학생의 출석에 대해 어떠한 권한 및 책임도 가지고 있지 않습니다. <br/>

        따라서 사이트에서 제공하는 기능이 아닌, 주최자와 참가자 사이에서 발생하는 분쟁에 관해 회사가 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다. <br/>

        3. 회사는 천재지변, 전쟁 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임이 면제됩니다. <br/>

        4. 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 회사의 고의 또는 중과실이 있는 경우를 제외하고 책임이 면제됩니다 <br/>

        5. 회사는 이용자의 귀책사유로 인한 서비스 이용의 장애 또는 손해에 대하여 회사의 고의 또는 중과실이 있는 경우를 제외하고 책임을 지지 않습니다. <br/>

        6. 회사는 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 신상정보 및 전자우편 주소를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않습니다. <br/>

        7. 회사는 이용자가 본 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다. <br/>

        8. 회사는 이용자가 본 서비스를 이용하면서 얻은 자료로 인한 손해에 대하여 회사의 고의 또는 중과실이 있는 경우를 제외하고 책임을 지지 않습니다. <br/>

        9. 회사는 이용자가 본 서비스를 이용하며 다른 이용자로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않습니다. <br/>
        </Text>
        <br/>
        <Text typo={'Text_SB_20'}>
            제 10조 금지사항
        </Text>
        <br/>
        <Text typo ={'Text_15'}>

        1. 회원은 본 서비스 이용 중 다음 각 호에 기재된 행위를 해서는 안 됩니다. <br/>

        1) 공공질서 또는 미풍양속을 저해할 우려가 있는 행위 <br/>

        2) 과도하게 폭력적인 표현, 노골적인 성적 표현, 인종, 국적, 신조, 성별, 사회적 신분과 가문 등에 관하여 차별하는 표현, 자살, 자상 행위, 약물 남용을 유인 또는 조장하는 표현, 기타
        반사회적인 내용을 포함하고 타인에게 불쾌감을 주는 표현을 송신하는 행위 <br/>

        3) 범죄와 결부된 행위 <br/>

        4) 반사회적인 세력에 대한 이익 공여와 기타 협력 행위 <br/>

        5) 과도한 종교 단체 권유 행위 <br/>

        6) 성적 또는 외설적 목적이 있는 행위 <br/>

        7) 회사가 스팸으로 판단한 행위 <br/>

        8) 본 서비스가 제공하는 방법 이외의 방법으로 영리를 취하려는 행위 (영업, 선전, 광고, 권유 등) <br/>

        9) 타인의 개인정보, 이용 이력 정보 등을 불법으로 수집, 공개 또는 제공하는 행위 <br/>

        10) 회사 또는 제 3자를 사칭하는 행위 또는 의도적으로 허위 정보를 유포하는 행위 <br/>

        11) 회사 또는 제 3자의 저작권, 상표권, 특허권 등의 지적재산권, 명예권, 프라이버시권, 기타 법령상 또는 계약상의 권리를 침해하는 행위 <br/>

        12) 본 서비스의 서버와 네트워크 시스템에 지장을 주는 행위, 봇, 치팅 툴, 기타 기술적인 수단을 이용하여 서비스를 불법으로 조작하는 행위, 본 서비스의 장애를 의도적으로 이용하는 행위 <br/>

        13) 동일한 질문을 필요 이상으로 반복하는 등 회사에 대해 부당한 문의 또는 요구를 하는 행위, 본 서비스 운영 또는 다른 회원의 서비스 이용을 방해하거나 지장을 주는 행위 <br/>

        14) 상기 각 호에 해당하는 행위를 원조 또는 조장하는 행위 <br/>

        15) 기타 회사가 부적절하다 판단한 행위 <br/>
        </Text>
        <Text typo={'Text_SB_20'}>
            제 11조 서비스 중단
        </Text>
            <br/>
        <Text typo ={'Text_15'}>
        1. 회사는 이용 감소로 인한 원활한 서비스 제공의 곤란 및 수익성 악화, 기술 진보에 따른 차세대 서비스로의 전환 필요성, 서비스 제공과 관련한 회사 정책의 변경 등 기타 상당한 이유가 있는 경우에
        운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경 또는 중단할 수 있습니다. <br/>
        2. 서비스의 내용, 이용방법, 이용시간에 대하여 변경 또는 서비스 중단이 있는 경우에는 변경 또는 중단될 서비스의 내용 및 사유와 일자 등은 그 변경 또는 중단 전에 회사에서 운영하는 사이트 또는
        이메일 등 회원이 충분이 인지할 수 있는 방법으로 7일의 기간을 두고 사전에 공지합니다. <br/>
        3. 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지
        않습니다. <br/>
        4. 서비스의 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만 정기 점검 등의 필요로 회사가 정한 날이나 시간은 제외됩니다. <br/>
        5. 회사의 사정으로 서비스를 영구적으로 중단해야 할 경우 서비스 중단의 20일 이상의 기간 전에 회원에게 앞서 언급한 방법들 중 하나를 통해 고지합니다. <br/>
        6. 회사는 서비스 중지에 의하여 본 서비스에 보관되거나 전송된 콘텐츠 및 기타 통신 데이터 등의 내용이 보관되지 못하였거나 삭제된 경우, 전송되지 못한 경우 및 기타 통신 데이터의 손실이 있을 경우에
        대하여 책임을 부담하지 않습니다. <br/>
        </Text>

        <br/>
        <Text typo={'Text_SB_20'}>
            제 12조 개인정보보호정책
            </Text>
            <br/>
        <Text typo={'Text_15'}>
        1. 회사는 회원의 개인정보를 보호하고 분쟁을 완화하기 위해 회사에서 수립한 개인정보보호정책을 따릅니다. <br/>
        2. 회사의 고의 또는 중과실이 있는 경우를 제외하고, 회원의 귀책사유로 인해 노출된 정보에 대해 회사는 어떤 책임도 지지 않습니다. <br/>
        3. 국가안보 또는 법령에 위배되는 자료를 본 서비스에서 배포할 경우 관련 국가기관의 요청이 있을 시 해당 자료를 관련기관에 제출할 수 있습니다. <br/>
        </Text> 
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 13조 연락 방법
        </Text>
            <br/>
        <Text typo ={'Text_15'}>
        1. 본 서비스와 관련해 회사가 회원에게 연락할 때는 회사가 운영하는 웹사이트 내의 적당한 장소에 게시하거나 회원 이메일을 통해 연락합니다. <br/>
        2. 본 서비스와 관련해 회원이 회사에 연락할 때는 회사 전화번호를 통해 연락 가능합니다. <br/>
        번호 : 010-7625-4687 <br/>
        </Text>

        <Text typo={'Text_SB_20'}>
            제 14조 준거법과 재판 관할
        </Text>
            <br/>
        <Text typo ={'Text_15'}>
        1. 본 약관은 한국어를 정본으로 하며, 대한민국법을 준거법으로 합니다. <br/>
        2. 본 서비스 이용에 관하여 회사와 회원 간에 분쟁이 있는 경우 양 당사자는 분쟁해결을 위한 노력을 다해야 합니다. <br/>
        3. 본 서비스 이용에 관하여 회사와 회원 간에 발생한 분쟁에 대해서는 회사 소재지를 관할 하는 법을을 제 1심 관할 법원으로 합니다. <br/>
        </Text>
        <br/>
            부칙
            <br/>

        <Text typo={'Text_M_20'}>
            제 1조(시행일)
        </Text>
            <br/>
        <Text typo={'Text_15'}>
        본 약관은 2023.03.19일 부터 적용합니다 <br/>
        </Text>
    </p>

export const agreement2 =
    <p>
        <Text typo ={'Header_20'}>
            개인정보수집/이용 동의
        </Text>
        <br/>
        <br/>
        <Text typo={'Text_SB_20'}>
            총칙
        </Text>
        <br/>
        <Text typo={'Text_15'}>
        개인정보수집/이용 동의 개인정보 취급방침 <br/>

        binary-ho (이하 “회사”)에서 제공하는 모든 제품 및 서비스 (이하 “본 서비스”)는 이용자의 개인정보를 중요시하며, 정보통신망 이용촉진 및 정보보호에 관한 법률, 개인정보보호법 등을 준수하고
        있습니다. 관련 법령에 의거한 개인정보취급방침을 정하여 이용자의 권익 보호에 최선을 다하고 있습니다.<br/>

        본 서비스를 이용하거나 회원가입을 통해 본 서비스의 회원이 될 경우 본 약관 및 관련 운영 정책을 동의하신 것으로 봅니다.<br/>

        본 방침은 2023년 03월 19일 부터 시행됩니다.<br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 1조 수집하는 개인정보 항목 및 수집방법
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
        회사는 이용자의 사전 동의 없이 이용자 개인 정보를 공개하지 않으며, 다음과 같은 항목들을 수집합니다. <br/>
        </Text>
        <br/>
        <Text typo = {'Text_M_20'}>
            가. 수집하는 개인정보의 항목
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        ”개인 식별”, ”회원 관리”, “수업 출석 체크” 위해 아래와 같은 개인정보를 수집하고 있습니다. <br/>
        1. 이메일 주소 : 개인 식별, 회원 관리, 이메일 인증, 수강 신청, 수업 출석 체크 <br/>
        2. 유저 이름 : 개인 식별, 회원 관리, 수강 신청, 수업 출석 체크 <br/>
        3. 비밀번호 : 회원 관리 (비밀번호는 단방향 암호화를 통해 DB에 저장됩니다.) <br/>
        4. 가입 일시 : 회원 관리 <br/>
        5. 접속 일시 : 수업 출석 체크 <br/>
        6. 접속 위치 좌표 : 수업 출석 체크 <br/>
        </Text>
        <br/>
        <Text typo = {'Text_M_20'}>
            나. 개인정보의 수집방법
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회사는 다음과 같은 방법으로 개인정보를 수집합니다. <br/>
        브라우저 내에 유저가 직접 입력 : 유저 이름, 이메일 주소, 비밀번호 <br/>
        프로그램 자동 기입 : 가입 일시, 접속 일시, 접속 위치 좌표 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 2조 개인정보의 수집 및 이용목적
        </Text>
        <br/>

        <Text typo ={'Text_15'}>
            이용자는 회사가 마련한 개인정보 처리 방침 또는 이용약관의 내용에 대해 동의 버튼을 클릭함으로써 개인정보 수집에 대하여 동의 여부를 표시할 수 있으며, 동의 버튼을 클릭할 경우에는 개인정보
            수집에
            동의한 것으로 봅니다.
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
            수집한 개인정보를 다음의 목적을 위해 활용합니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
            2.1 회원관리 : 이메일과 이메일 인증 유저 이름, 비밀번호를 통한 본인 인증과 개인 식별, 불량회원의 부정 이용 방지. 가입 일자를 통해 개인정보 파기 기한 준수 목적 <br/>
            2.2 수업 수강신청, 수업 개설 등 수업 관리 : 이메일과 이름을 통한 강사와 수강생간 개인을 식별할 목적 <br/>
            2.3 수업 출석 체크 : 접속 일시와 접속 위치 좌표를 통한 부정 출석 체크 방지 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 3조 개인정보의 공유 및 제공
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회사는 이용자들의 개인정보를 제 1, 2조에서 고지한 범위 내에서 사용하며, 이용자의 사전 동의 없이는 이용자들의 개인정보를 범위를 초과한 목적으로 이용하지 않습니다. <br/>

        또한, 이용자들의 개인정보를 원칙적으로 외부에 제공하지 않습니다. <br/>

        다만, 아래의 경우에는 예외로 합니다. <br/>
        1. 이용자가 사전에 동의한 경우 <br/>

        2. 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 4조 개인정보의 보유 및 이용기간
        </Text>
        <br/>
        <Text typo= {'Text_15'}>
        법령에서 별도로 정하거나 귀하와 별도 합의하는 등의 특별 사정이 없는 한 이용자가 회원으로써 제공 받는 서비스를 이용하는 동안 제 2조에서 정한 목적을 달성할 때까지 회사는 이용자들의 개인정보를
        계속적으로 보유하며 서비스 제공 등을 위해 이용합니다. <br/>

        원칙적으로, 개인정보 수집 및 이용목적이 달성된 후나 회원이 탈퇴한 이후 해당 정보를 지체 없이 파기합니다. <br/>

        단, 아래의 이유로 다음의 정보에 대해서는 명시한 기간 동안 보존합니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            가. 회사 내부방침에 의한 정보보유 사유
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회원이 탈퇴한 경우에도 회사는 원활한 서비스의 제공 및 부정한 서비스의 이용을 방지하기 위하여 아래와 같이
        회원정보를 보관합니다. <br/> <br/>
        </Text>

        <Text typo ={'Text_M_20'}>
            이름(별명), 이메일 주소, 사용자 접속 시각, 위치
        </Text><br/>
        <Text typo ={'Text_15'}>
        보존이유: 서비스 이용의 혼선방지, 분쟁해결 및 수사기관의 요청에 따른 협조 <br/>
        보존기간 : 탈퇴 이후 1년 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            부정/불량이용기록 (부정/불량이용자의 개인정보 포함)
        </Text><br/>
        <Text typo ={'Text_15'}>
        보존이유 : 서비스의 부정 및 불량 이용 방지 및 부정/불량이용자의 재가입 방지 <br/>
        보존기간 : 탈퇴 이후 1년 <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            제 5조 개인정보의 파기절차 및 방법
        </Text><br/>
        <Text typo ={'Text_15'}>
        회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다. <br/>
        </Text><br/>
        <Text typo ={'Text_M_20'}>
            가. 파기절차
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회원님이 회원가입 등을 위해 입력하신 이름과 이메일 비밀번호는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 (보유 및 이용기간 참조) 탈퇴시나,
        일정 기간 저장된 후 파기 되어집니다. <br/>
        별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            나. 파기방법
        </Text>
        <Text typo ={'Text_15'}>
        전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 6조 수집한 개인정보의 위탁
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회사는 서비스 향상을 위해 이용자의 개인정보를 서비스 제공을 위해 반드시 필요한 업무 중 일부의 수행을 위해 개인정보를 위탁하고 있으며, <br/>
        관계 법령에 따라 위탁계약시 개인정보가 안전하게 관리될 수
        있도록 필요한 사항을 규정하고 있습니다. 또한 공유하는 정보는 당해 목적을 달성하기 위하여 필요한 최소한의 정보에 국한됩니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_M_20'}>
            1. 개인 정보 데이터 보관 및 시스템 운영 : Amazon Web Services, inc
        </Text><br/>
        <Text typo ={'Text_15'}>
        보존 기간 : 회원 탈퇴 또는 개인정보 유효기간 도래시까지 보관 
        </Text>
        <br/> <br/>
        <Text typo ={'Text_15'}>회사는 이용자의 동의 없이 앞서 기재한 정보 외의 이용자의 정보를 외부 업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위 탁 대상자와 위탁 업무 내용에 대해 이용자님께 통지하고 필요한 경우
        사전 동의를 받도록 하겠습니다.</Text> <br/>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 7조 이용자 및 법정대리인의 권리와 그 행사방법
        </Text>
        <Text typo ={'Text_15'}>
        이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다. <br/>
        이용자들의 가입해지 (동의철회)를 위 해서는 '회원탈퇴'를 클릭하여 본인 확인 절차를 거치신 후 직접 탈퇴가 가능합니다. (버튼 미구현의 경우 요청 주시면 바로 회원 탈퇴 진행하겠습니다.) <br/>
        혹은 개인정보 관리 책임자에게 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다. <br/>

        이용자가 개인정보의 오류에 대한 정정을 요청하는 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또 는 제공하지 않습니다. <br/>
        또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를
        제3자에게 지 체 없이 통지하여 정정이 이루어지도록 하겠습니다. <br/>

        회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 "회사가 수집하는 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고
        있습니다. <br/>
        </Text>
        <br/>
        <Text typo ={'Text_SB_20'}>
            제 8조 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
        </Text>
        <br/>
        <Text typo ={'Text_15'}>
        회사는 귀하의 가입 일시, 접속 시각, 접속 위치를 파악하고 저장하는 수집 장치를 운용합니다. <br/>

        이는 프로그래밍상으로 브라우저에서 자동 수집되도록 구현 되었으며, 접속 위치의 경우엔 브라우저를 통해 직접 동의하셔야 합니다. 이들은 브라우저에서 수집되어 텍스트로서 서버에 전달되고, DB에
        저장됩니다. <br/>

        가. 사용 목적 <br/>
        가입 일시의 경우 개인 정보 보호 기간과 대조하기 위해 사용됩니다. 접속 시각, 접속 위치의 경우 “출석 체크” 기능 이용시 수집되고 강사에게 제공됩니다. <br/>
        나. 접속 위치 수집 거부 방법 <br/>
        이용자는 접속 위치 수집에 대한 선택권을 가지고 있습니다. <br/>
        이용자님이 사용하시 는 웹 브라우저에서 출석 체크 기능 이용시 허가 창을 띄워주며, 거절 버튼을 누름으로써 접속 장소 수집을 거부할 수 있습니다. <br/>

        브라우저 설정을 통해 위치 정보 수집을 차단할 수 있습니다. <br/>
        </Text>
        <br/>
        <Text typo={"Text_SB_20"}>
            제 9조 개인정보에 관한 민원서비스
        </Text>
        <br/>
        <Text typo={'Text_15'}>
        회사는 이용자님의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 개인정보관리 책임자를 지정하고 있습니다. <br/>
        개인정보관리책임자 : 이진호 <br/>
        이메일: dlwlsgh4687@gmail.com <br/>
        귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자에게 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴
        것입니다.</Text> <br/><br/>
        <Text typo={'Text_15'}>
        기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다. <br/>
        개인정보보호 침해센터 http://privacy.kisa.or.kr    (02-405-5118) <br/>
        대검찰청 사이버범죄신고 http://spo.go.kr    (02-3480-2000 <br/>
        경찰청 사이버테러대응센터 http://www.ctrc.go.kr    (1566-0112) <br/>
        </Text>
        <br/>

         <Text typo={"Text_SB_20"}>
            제 10조 기타 사항
        </Text>
        <br/>
        <Text typo={'Text_15'}>
        홈페이지에 링크되어 있는 웹사이트들이 개인정보를 수집하는 개별적인 행위에 대해서는 본 "개인정보취급방침"이 적용되지 않음을 알려 드립니다. (현재 링크 되어 있는 웹사이트는 없습니다.) <br/>
        </Text>
        <br/>

        <Text typo={"Text_SB_20"}>
            제 11조 고지의 의무
        </Text>
        <br/>
        <Text typo={'Text_15'}>
        현 개인정보취급방침의 내용이 변경될 경우에는 개정 최소 7일 전부터 가입시 입력하신 이메일을 통해 고지하겠습니다. <br/>
        다만, 개인정보의 수집 및 활용, 제3자 제공 등과 같이 권리의 중요한 변경이 있을
        경우에는 최소 30일 전 에 고지합니다. <br/>
        시행일자 : 2023년 03월 19일 <br/>
        </Text>
    </p>
